136185925/STM32F769I-DISCO-USB-Audio-Upsampler/Core/Src/audio_player.c
#include "audio_player.h"

#include "audio_recorder.h"
#include "audio_spectrum.h"
#include "fatfs.h"
#include "sdmmc.h"
#include "spdif_iir_upsampler.h"
#include "spdif_minphase_fir.h"
#include "spdif_wls_listen.h"
#include "spdif_tx.h"
#include "spdif_upsampler.h"
#include "touch.h"
#include "usb_audio.h"
#include "stm32f769i_discovery_audio.h"
#include "FreeRTOS.h"
#include "queue.h"
#include "task.h"

#include <string.h>
#include <stdio.h>

#define PLAYER_DEFAULT_VOLUME       20U
#define PLAYER_DMA_BYTES            32768U
#define PLAYER_HALF_BYTES           (PLAYER_DMA_BYTES / 2U)
#define PLAYER_COMMAND_QUEUE_LENGTH 8U
#define PLAYER_NOTIFY_HALF          (1UL << 0)
#define PLAYER_NOTIFY_FULL          (1UL << 1)
#define PLAYER_NOTIFY_COMMAND       (1UL << 2)
#define PLAYER_SPDIF_FACTOR         SPDIF_UPSAMPLER_FACTOR
#define PLAYER_UPSAMPLE_INPUT_FRAMES \
    (PLAYER_HALF_BYTES / (8U * PLAYER_SPDIF_FACTOR))

#if ((PLAYER_HALF_BYTES / 8U) % PLAYER_SPDIF_FACTOR) != 0U
#error "Player DMA half-buffer must contain complete 4x S/PDIF groups"
#endif

typedef enum
{
  PLAYER_COMMAND_PLAY = 1,
  PLAYER_COMMAND_TOGGLE,
  PLAYER_COMMAND_SEEK,
  PLAYER_COMMAND_VOLUME,
  PLAYER_COMMAND_STOP
} PlayerCommandType;

typedef struct
{
  uint8_t type;
  uint16_t value;
  char filename[13];
} PlayerCommand;

typedef struct
{
  uint16_t channels;
  uint16_t bits_per_sample;
  uint16_t block_align;
  uint32_t sample_rate;
  uint32_t byte_rate;
  uint32_t data_offset;
  uint32_t data_bytes;
} PlayerWaveInfo;

volatile uint32_t audio_player_generation = 0U;
volatile uint32_t audio_player_dma_half_count = 0U;
volatile uint32_t audio_player_dma_full_count = 0U;
volatile uint32_t audio_player_refill_count = 0U;
volatile uint32_t audio_player_error_count = 0U;
volatile uint8_t audio_player_debug_command = 0U;

__attribute__((section(".dma_buffer"), aligned(32)))
static uint8_t player_dma_buffer[PLAYER_DMA_BYTES];

static QueueHandle_t player_command_queue;
static TaskHandle_t player_task_handle;
static AudioPlayerSnapshot player_snapshot;
static volatile uint8_t player_active;
static uint8_t player_volume = PLAYER_DEFAULT_VOLUME;
static USB_AudioOutput player_output = USB_AUDIO_OUTPUT_WM8994;
static uint8_t player_spdif_upsample;
static uint8_t player_spdif_headroom;
static uint8_t player_spdif_repeat;
static uint8_t player_spdif_tpdf;
static uint8_t player_spdif_iir;
static uint8_t player_spdif_hybrid;
static uint8_t player_spdif_hybrid_ns2;
static uint8_t player_spdif_minphase_ns2;
static uint8_t player_spdif_minphase_ns5;
static uint8_t player_spdif_minphase_fir;
static uint8_t player_spdif_wls_listen;
static uint32_t player_spdif_status_frame;
static SPDIF_Upsampler4x player_spdif_upsampler;
static SPDIF_IirUpsampler4x player_spdif_iir_upsampler;
static SPDIF_HybridUpsampler4x player_spdif_hybrid_upsampler;
static SPDIF_MinimumPhaseFir4x player_spdif_minphase_fir_upsampler;
static SPDIF_WlsListen4x player_spdif_wls_listen_upsampler;
static uint16_t player_spdif_tail_frames;
static uint8_t player_last_fill_output_valid;

/* Cached CPU staging prevents forward filter processing from overwriting the
 * compact WAV frames while the DMA destination expands to 32 bytes per input
 * frame. 4x mode is limited to 16-bit mono/stereo, hence four bytes/frame. */
static uint8_t player_upsample_input[PLAYER_UPSAMPLE_INPUT_FRAMES * 4U];

static uint16_t Player_ReadLe16(const uint8_t *data)
{
  return (uint16_t)((uint16_t)data[0] | ((uint16_t)data[1] << 8));
}

static uint32_t Player_ReadLe32(const uint8_t *data)
{
  return (uint32_t)data[0] | ((uint32_t)data[1] << 8) |
         ((uint32_t)data[2] << 16) | ((uint32_t)data[3] << 24);
}

static int32_t Player_ReadLe24Signed(const uint8_t *data)
{
  uint32_t value = (uint32_t)data[0] | ((uint32_t)data[1] << 8) |
                   ((uint32_t)data[2] << 16);
  if ((value & 0x00800000UL) != 0U)
  {
    value |= 0xFF000000UL;
  }
  return (int32_t)value;
}

static void Player_Publish(AudioPlayerSnapshot *snapshot)
{
  taskENTER_CRITICAL();
  snapshot->generation = ++audio_player_generation;
  player_snapshot = *snapshot;
  taskEXIT_CRITICAL();
}

static void Player_UpdatePosition(AudioPlayerSnapshot *snapshot, uint32_t position_bytes)
{
  if (position_bytes > snapshot->data_bytes)
  {
    position_bytes = snapshot->data_bytes;
  }
  snapshot->position_bytes = position_bytes;
  snapshot->position_ms = (snapshot->data_bytes == 0U) ? 0U :
      (uint32_t)(((uint64_t)position_bytes * snapshot->duration_ms) /
                 snapshot->data_bytes);
  taskENTER_CRITICAL();
  player_snapshot.position_bytes = snapshot->position_bytes;
  player_snapshot.position_ms = snapshot->position_ms;
  taskEXIT_CRITICAL();
}

void AudioPlayer_GetSnapshot(AudioPlayerSnapshot *snapshot)
{
  if (snapshot == NULL)
  {
    return;
  }
  taskENTER_CRITICAL();
  *snapshot = player_snapshot;
  taskEXIT_CRITICAL();
}

uint8_t AudioPlayer_IsBusy(void)
{
  return player_active;
}

void AudioPlayer_CreateResources(void)
{
  memset(&player_snapshot, 0, sizeof(player_snapshot));
  player_snapshot.status = AUDIO_PLAYER_IDLE;
  player_snapshot.volume = PLAYER_DEFAULT_VOLUME;
  player_volume = PLAYER_DEFAULT_VOLUME;
  player_command_queue = xQueueCreate(PLAYER_COMMAND_QUEUE_LENGTH,
                                      sizeof(PlayerCommand));
}

static void Player_SendCommand(PlayerCommand *command)
{
  if ((player_command_queue != NULL) &&
      (xQueueSend(player_command_queue, command, pdMS_TO_TICKS(20U)) == pdPASS))
  {
    if (player_task_handle != NULL)
    {
      (void)xTaskNotify(player_task_handle, PLAYER_NOTIFY_COMMAND, eSetBits);
    }
  }
  else
  {
    ++audio_player_error_count;
  }
}

void AudioPlayer_RequestPlay(const char *filename)
{
  if ((SD_Storage_ApplicationAccessAllowed() == 0U) ||
      (USB_Audio_ClaimsCodec() != 0U)) return;
  PlayerCommand command;
  if (filename == NULL) return;
  memset(&command, 0, sizeof(command));
  command.type = PLAYER_COMMAND_PLAY;
  strncpy(command.filename, filename, sizeof(command.filename) - 1U);
  Player_SendCommand(&command);
}

void AudioPlayer_RequestTogglePause(void)
{
  PlayerCommand command = {0};
  command.type = PLAYER_COMMAND_TOGGLE;
  Player_SendCommand(&command);
}

void AudioPlayer_RequestSeek(uint16_t permille)
{
  PlayerCommand command = {0};
  command.type = PLAYER_COMMAND_SEEK;
  command.value = permille > 1000U ? 1000U : permille;
  Player_SendCommand(&command);
}

void AudioPlayer_RequestVolume(uint8_t volume)
{
  PlayerCommand command = {0};
  command.type = PLAYER_COMMAND_VOLUME;
  command.value = volume > 100U ? 100U : volume;
  Player_SendCommand(&command);
}

void AudioPlayer_RequestStop(void)
{
  PlayerCommand command = {0};
  command.type = PLAYER_COMMAND_STOP;
  Player_SendCommand(&command);
}

static FRESULT Player_ReadExact(FIL *file, void *buffer, UINT size)
{
  UINT read = 0U;
  FRESULT result = f_read(file, buffer, size, &read);
  return ((result == FR_OK) && (read == size)) ? FR_OK :
         ((result == FR_OK) ? FR_INVALID_OBJECT : result);
}

static uint8_t Player_IsSupportedRate(uint32_t rate)
{
  return ((rate == 8000U) || (rate == 11025U) || (rate == 16000U) ||
          (rate == 22050U) || (rate == 32000U) || (rate == 44100U) ||
          (rate == 48000U) || (rate == 96000U)) ? 1U : 0U;
}

