136185925/STM32F769I-DISCO-USB-Audio-Upsampler/Core/Src/audio_player.c
static FRESULT Player_ParseWave(FIL *file, PlayerWaveInfo *info)
{
  uint8_t riff[12];
  uint8_t chunk[8];
  uint8_t fmt[40];
  static const uint8_t pcm_subformat[16] =
      {0x01U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x10U, 0x00U,
       0x80U, 0x00U, 0x00U, 0xAAU, 0x00U, 0x38U, 0x9BU, 0x71U};
  uint8_t fmt_found = 0U;
  uint8_t data_found = 0U;
  FRESULT result;

  memset(info, 0, sizeof(*info));
  result = Player_ReadExact(file, riff, sizeof(riff));
  if (result != FR_OK) return result;
  if ((memcmp(&riff[0], "RIFF", 4U) != 0) ||
      (memcmp(&riff[8], "WAVE", 4U) != 0))
  {
    return FR_INVALID_OBJECT;
  }

  while (f_tell(file) + 8U <= f_size(file))
  {
    uint32_t chunk_size;
    uint32_t chunk_data;
    result = Player_ReadExact(file, chunk, sizeof(chunk));
    if (result != FR_OK) return result;
    chunk_size = Player_ReadLe32(&chunk[4]);
    chunk_data = f_tell(file);
    if (memcmp(chunk, "fmt ", 4U) == 0)
    {
      uint32_t fmt_bytes = chunk_size < sizeof(fmt) ? chunk_size : sizeof(fmt);
      uint16_t format_tag;
      uint16_t bits_per_sample;
      if (chunk_size < 16U) return FR_INVALID_OBJECT;
      memset(fmt, 0, sizeof(fmt));
      result = Player_ReadExact(file, fmt, fmt_bytes);
      if (result != FR_OK) return result;
      format_tag = Player_ReadLe16(&fmt[0]);
      bits_per_sample = Player_ReadLe16(&fmt[14]);
      if (((format_tag != 1U) &&
           ((format_tag != 0xFFFEU) || (chunk_size < 40U) ||
            (Player_ReadLe16(&fmt[16]) < 22U) ||
            (Player_ReadLe16(&fmt[18]) != bits_per_sample) ||
            (memcmp(&fmt[24], pcm_subformat, sizeof(pcm_subformat)) != 0))) ||
          ((Player_ReadLe16(&fmt[2]) != 1U) && (Player_ReadLe16(&fmt[2]) != 2U)) ||
          ((bits_per_sample != 16U) && (bits_per_sample != 24U)))
      {
        return FR_INVALID_PARAMETER;
      }
      info->channels = Player_ReadLe16(&fmt[2]);
      info->bits_per_sample = bits_per_sample;
      info->sample_rate = Player_ReadLe32(&fmt[4]);
      info->byte_rate = Player_ReadLe32(&fmt[8]);
      info->block_align = Player_ReadLe16(&fmt[12]);
      fmt_found = 1U;
    }
    else if (memcmp(chunk, "data", 4U) == 0)
    {
      info->data_offset = chunk_data;
      info->data_bytes = chunk_size;
      if (info->data_offset + info->data_bytes > f_size(file))
      {
        info->data_bytes = f_size(file) - info->data_offset;
      }
      data_found = 1U;
    }

    if ((fmt_found != 0U) && (data_found != 0U)) break;
    result = f_lseek(file, chunk_data + chunk_size + (chunk_size & 1U));
    if (result != FR_OK) return result;
  }

  if ((fmt_found == 0U) || (data_found == 0U) ||
      (info->block_align !=
       (uint16_t)(info->channels * (info->bits_per_sample / 8U))) ||
      (info->byte_rate != (info->sample_rate * info->block_align)) ||
      (Player_IsSupportedRate(info->sample_rate) == 0U))
  {
    return FR_INVALID_PARAMETER;
  }
  info->data_bytes -= info->data_bytes % info->block_align;
  return f_lseek(file, info->data_offset);
}

static uint32_t Player_FillSpdifUpsampledHalf(
    FIL *file, const PlayerWaveInfo *wave, uint8_t half,
    uint32_t loaded_bytes, uint8_t *io_error)
{
  uint32_t *output = (uint32_t *)&player_dma_buffer[half * PLAYER_HALF_BYTES];
  const uint32_t output_frames = PLAYER_HALF_BYTES / 8U;
  const uint32_t groups_needed = output_frames / PLAYER_SPDIF_FACTOR;
  const uint32_t remaining = wave->data_bytes - loaded_bytes;
  uint32_t source_frames = remaining / wave->block_align;
  uint32_t source_bytes;
  uint32_t output_group = 0U;
  UINT read = 0U;
  FRESULT result;

  player_last_fill_output_valid = 0U;
  if (source_frames > groups_needed) source_frames = groups_needed;
  source_bytes = source_frames * wave->block_align;
  if (source_bytes != 0U)
  {
    result = f_read(file, player_upsample_input, source_bytes, &read);
    if (result != FR_OK)
    {
      *io_error = (uint8_t)result;
      return 0U;
    }
    source_bytes = read - (read % wave->block_align);
    source_frames = source_bytes / wave->block_align;
  }

  for (uint32_t frame = 0U; frame < source_frames; ++frame)
  {
    const uint8_t *input = &player_upsample_input[frame * wave->block_align];
    const int16_t left = (int16_t)Player_ReadLe16(input);
    const int16_t right = (wave->channels == 2U) ?
        (int16_t)Player_ReadLe16(input + 2U) : left;
    int16_t interpolated[PLAYER_SPDIF_FACTOR * 2U];
    if (player_spdif_repeat != 0U)
    {
      for (uint32_t phase = 0U; phase < PLAYER_SPDIF_FACTOR; ++phase)
      {
        interpolated[phase * 2U] = left;
        interpolated[phase * 2U + 1U] = right;
      }
    }
    else if (player_spdif_iir != 0U)
    {
      SPDIF_IirUpsampler4x_Process(&player_spdif_iir_upsampler, left, right,
                                   interpolated);
    }
    else if (player_spdif_wls_listen != 0U)
    {
      SPDIF_WlsListen4x_Process(
          &player_spdif_wls_listen_upsampler, left, right, interpolated);
    }
    else if (player_spdif_minphase_fir != 0U)
    {
      SPDIF_MinimumPhaseFir4x_Process(
          &player_spdif_minphase_fir_upsampler, left, right, interpolated);
    }
    else if (player_spdif_minphase_ns5 != 0U)
    {
      SPDIF_MinimumPhaseUpsampler4x_ProcessNoiseShaped5(
          &player_spdif_hybrid_upsampler, left, right, interpolated);
    }
    else if (player_spdif_minphase_ns2 != 0U)
    {
      SPDIF_MinimumPhaseUpsampler4x_ProcessNoiseShaped2(
          &player_spdif_hybrid_upsampler, left, right, interpolated);
    }
    else if (player_spdif_hybrid_ns2 != 0U)
    {
      SPDIF_HybridUpsampler4x_ProcessNoiseShaped2(
          &player_spdif_hybrid_upsampler, left, right, interpolated);
    }
    else if (player_spdif_hybrid != 0U)
    {
      SPDIF_HybridUpsampler4x_Process(&player_spdif_hybrid_upsampler,
                                      left, right, interpolated);
    }
    else
    {
      SPDIF_Upsampler4x_Process(&player_spdif_upsampler, left, right,
                                interpolated, player_spdif_headroom,
                                player_spdif_tpdf);
    }
    for (uint32_t phase = 0U; phase < PLAYER_SPDIF_FACTOR; ++phase)
    {
      output[(output_group * PLAYER_SPDIF_FACTOR + phase) * 2U] =
          SPDIF_TX_EncodeSample(interpolated[phase * 2U], 16U,
                                wave->sample_rate * PLAYER_SPDIF_FACTOR,
                                player_spdif_status_frame);
      output[(output_group * PLAYER_SPDIF_FACTOR + phase) * 2U + 1U] =
          SPDIF_TX_EncodeSample(interpolated[phase * 2U + 1U], 16U,
                                wave->sample_rate * PLAYER_SPDIF_FACTOR,
                                player_spdif_status_frame);
      player_spdif_status_frame =
          (player_spdif_status_frame + 1U) % 192U;
    }
    ++output_group;
  }

  if ((player_spdif_repeat == 0U) &&
      (source_bytes != 0U) &&
      ((loaded_bytes + source_bytes) >= wave->data_bytes))
  {
    if (player_spdif_wls_listen != 0U)
      player_spdif_tail_frames = SPDIF_WlsListen4x_GetTailFrames(
          &player_spdif_wls_listen_upsampler);
    else if (player_spdif_minphase_fir != 0U)
      player_spdif_tail_frames = SPDIF_MINPHASE_FIR_TAIL_FRAMES;
    else if ((player_spdif_minphase_ns2 != 0U) ||
        (player_spdif_minphase_ns5 != 0U))
      player_spdif_tail_frames = SPDIF_IIR_UPSAMPLER_TAIL_FRAMES;
    else if ((player_spdif_hybrid != 0U) ||
        (player_spdif_hybrid_ns2 != 0U))
      player_spdif_tail_frames = SPDIF_HYBRID_UPSAMPLER_TAIL_FRAMES;
    else if (player_spdif_iir != 0U)
      player_spdif_tail_frames = SPDIF_IIR_UPSAMPLER_TAIL_FRAMES;
    else
      player_spdif_tail_frames = SPDIF_UPSAMPLER_DELAY_FRAMES;
  }

  /* Clock zero-valued source frames through the causal filters after EOF.
   * WLS LISTEN drains both 2x stages; the single-stage polyphase FIR modes
   * drain their longest 64-sample history, while the legacy FIR emits its 16
   * delayed anchors. Recursive filters get a longer finite drain. */
  while ((output_group < groups_needed) && (player_spdif_tail_frames != 0U))
  {
    int16_t interpolated[PLAYER_SPDIF_FACTOR * 2U];
    if (player_spdif_iir != 0U)
    {
      SPDIF_IirUpsampler4x_Process(&player_spdif_iir_upsampler, 0, 0,
                                   interpolated);
    }
    else if (player_spdif_wls_listen != 0U)
    {
      SPDIF_WlsListen4x_Process(
          &player_spdif_wls_listen_upsampler, 0, 0, interpolated);
    }
    else if (player_spdif_minphase_fir != 0U)
    {
      SPDIF_MinimumPhaseFir4x_Process(
          &player_spdif_minphase_fir_upsampler, 0, 0, interpolated);
    }
    else if (player_spdif_minphase_ns5 != 0U)
    {
      SPDIF_MinimumPhaseUpsampler4x_ProcessNoiseShaped5(
          &player_spdif_hybrid_upsampler, 0, 0, interpolated);
    }
    else if (player_spdif_minphase_ns2 != 0U)
    {
      SPDIF_MinimumPhaseUpsampler4x_ProcessNoiseShaped2(
          &player_spdif_hybrid_upsampler, 0, 0, interpolated);
    }
    else if (player_spdif_hybrid_ns2 != 0U)
    {
      SPDIF_HybridUpsampler4x_ProcessNoiseShaped2(
          &player_spdif_hybrid_upsampler, 0, 0, interpolated);
    }
    else if (player_spdif_hybrid != 0U)
    {
      SPDIF_HybridUpsampler4x_Process(&player_spdif_hybrid_upsampler, 0, 0,
                                      interpolated);
    }
    else
    {
      SPDIF_Upsampler4x_Process(&player_spdif_upsampler, 0, 0, interpolated,
                                player_spdif_headroom, player_spdif_tpdf);
    }
    for (uint32_t phase = 0U; phase < PLAYER_SPDIF_FACTOR; ++phase)
    {
      output[(output_group * PLAYER_SPDIF_FACTOR + phase) * 2U] =
          SPDIF_TX_EncodeSample(interpolated[phase * 2U], 16U,
                                wave->sample_rate * PLAYER_SPDIF_FACTOR,
                                player_spdif_status_frame);
      output[(output_group * PLAYER_SPDIF_FACTOR + phase) * 2U + 1U] =
          SPDIF_TX_EncodeSample(interpolated[phase * 2U + 1U], 16U,
                                wave->sample_rate * PLAYER_SPDIF_FACTOR,
                                player_spdif_status_frame);
      player_spdif_status_frame =
          (player_spdif_status_frame + 1U) % 192U;
    }
    ++output_group;
    --player_spdif_tail_frames;
  }

  player_last_fill_output_valid =
      ((source_frames != 0U) || (output_group != source_frames)) ? 1U : 0U;
  for (uint32_t frame = output_group * PLAYER_SPDIF_FACTOR;
       frame < output_frames; ++frame)
  {
    output[frame * 2U] =
        SPDIF_TX_EncodeSample(0, 16U,
                              wave->sample_rate * PLAYER_SPDIF_FACTOR,
                              player_spdif_status_frame);
    output[frame * 2U + 1U] =
        SPDIF_TX_EncodeSample(0, 16U,
                              wave->sample_rate * PLAYER_SPDIF_FACTOR,
                              player_spdif_status_frame);
    player_spdif_status_frame =
        (player_spdif_status_frame + 1U) % 192U;
  }
  __DMB();
  ++audio_player_refill_count;
  return source_bytes;
}

