136185925/STM32F769I-DISCO-USB-Audio-Upsampler/Core/Src/audio_player.c
static uint32_t Player_FillHalf(FIL *file, const PlayerWaveInfo *wave,
                                uint8_t half, uint32_t loaded_bytes,
                                uint8_t *io_error)
{
  player_last_fill_output_valid = 0U;
  if ((player_output == USB_AUDIO_OUTPUT_SPDIF) &&
      (player_spdif_upsample != 0U))
  {
    return Player_FillSpdifUpsampledHalf(file, wave, half, loaded_bytes,
                                         io_error);
  }

  uint8_t *destination = &player_dma_buffer[half * PLAYER_HALF_BYTES];
  uint32_t remaining = wave->data_bytes - loaded_bytes;
  uint32_t output_frame_bytes =
      ((player_output == USB_AUDIO_OUTPUT_SPDIF) ||
       (wave->bits_per_sample == 24U)) ? 8U : 4U;
  uint32_t frame_capacity = PLAYER_HALF_BYTES / output_frame_bytes;
  uint32_t source_bytes;
  UINT read = 0U;
  FRESULT result;

  memset(destination, 0, PLAYER_HALF_BYTES);
  if (remaining == 0U) return 0U;

  source_bytes = remaining;
  if (source_bytes > (frame_capacity * wave->block_align))
  {
    source_bytes = frame_capacity * wave->block_align;
  }
  source_bytes -= source_bytes % wave->block_align;
  result = f_read(file, destination, source_bytes, &read);

  if (result != FR_OK)
  {
    *io_error = (uint8_t)result;
    return 0U;
  }
  if (read != source_bytes)
  {
    source_bytes = read - (read % wave->block_align);
  }
  if (source_bytes != 0U) player_last_fill_output_valid = 1U;

  /* S/PDIF always consumes one complete 32-bit DR word per sample, including
     24-bit MSB-aligned PCM and V/U/C. Expand backwards in place because the
     WAV source is packed more tightly than the SAI representation. */
  if (player_output == USB_AUDIO_OUTPUT_SPDIF)
  {
    uint32_t frames = source_bytes / wave->block_align;
    uint32_t *output = (uint32_t *)destination;
    const uint32_t first_status_frame = player_spdif_status_frame;
    for (uint32_t frame = frames; frame > 0U; --frame)
    {
      const uint8_t *input = &destination[(frame - 1U) * wave->block_align];
      int32_t left;
      int32_t right;
      uint32_t status_frame =
          (first_status_frame + frame - 1U) % 192U;
      if (wave->bits_per_sample == 24U)
      {
        left = Player_ReadLe24Signed(input);
        right = (wave->channels == 2U) ?
            Player_ReadLe24Signed(input + 3U) : left;
      }
      else
      {
        left = (int16_t)Player_ReadLe16(input);
        right = (wave->channels == 2U) ?
            (int16_t)Player_ReadLe16(input + 2U) : left;
      }
      output[(frame - 1U) * 2U] =
          SPDIF_TX_EncodeSample(left, wave->bits_per_sample,
                                wave->sample_rate, status_frame);
      output[(frame - 1U) * 2U + 1U] =
          SPDIF_TX_EncodeSample(right, wave->bits_per_sample,
                                wave->sample_rate, status_frame);
    }
    player_spdif_status_frame =
        (first_status_frame + frames) % 192U;
  }
  /* Expand backwards so packed 24-bit PCM can feed the WM8994 SAI1 path. */
  else if (wave->bits_per_sample == 24U)
  {
    uint32_t frames = source_bytes / wave->block_align;
    uint32_t *output = (uint32_t *)destination;
    for (uint32_t frame = frames; frame > 0U; --frame)
    {
      const uint8_t *input = &destination[(frame - 1U) * wave->block_align];
      int32_t left = Player_ReadLe24Signed(input);
      int32_t right = (wave->channels == 2U) ?
          Player_ReadLe24Signed(input + 3U) : left;
      /* SAI1 consumes the low 24 PCM bits. Keeping bits 31:24 clear lets the
         same word buffer feed SAI2 S/PDIF without asserting V/U/C flags. */
      output[(frame - 1U) * 2U] = (uint32_t)left & 0x00FFFFFFUL;
      output[(frame - 1U) * 2U + 1U] = (uint32_t)right & 0x00FFFFFFUL;
    }
  }
  else if (wave->channels == 1U)
  {
    uint32_t frames = source_bytes / wave->block_align;
    int16_t *output = (int16_t *)destination;
    for (uint32_t frame = frames; frame > 0U; --frame)
    {
      int16_t sample =
          (int16_t)Player_ReadLe16(&destination[(frame - 1U) * 2U]);
      output[(frame - 1U) * 2U] = sample;
      output[(frame - 1U) * 2U + 1U] = sample;
    }
  }
  __DMB();
  ++audio_player_refill_count;
  return source_bytes;
}

static uint8_t Player_CodecInit(uint32_t sample_rate, uint16_t bits_per_sample,
                                 uint8_t volume)
{
  uint8_t result;
  player_output = USB_Audio_GetOutput();
  player_spdif_upsample = 0U;
  player_spdif_headroom = 0U;
  player_spdif_repeat = 0U;
  player_spdif_tpdf = 0U;
  player_spdif_iir = 0U;
  player_spdif_hybrid = 0U;
  player_spdif_hybrid_ns2 = 0U;
  player_spdif_minphase_ns2 = 0U;
  player_spdif_minphase_ns5 = 0U;
  player_spdif_minphase_fir = 0U;
  player_spdif_wls_listen = 0U;
  player_spdif_tail_frames = 0U;
  SPDIF_Upsampler4x_Reset(&player_spdif_upsampler);
  SPDIF_IirUpsampler4x_Init(&player_spdif_iir_upsampler, sample_rate);
  SPDIF_HybridUpsampler4x_Init(&player_spdif_hybrid_upsampler, sample_rate);
  if (player_output == USB_AUDIO_OUTPUT_SPDIF)
  {
    const USB_AudioSpdifMode spdif_mode = USB_Audio_GetSpdifMode();
    if (spdif_mode == USB_AUDIO_SPDIF_UPSAMPLE_4X_WLS_LISTEN_NS5)
    {
      SPDIF_WlsListen4x_Init(
          &player_spdif_wls_listen_upsampler, sample_rate);
    }
    else if (spdif_mode == USB_AUDIO_SPDIF_UPSAMPLE_4X_WLS_LINEARPHASE_NS5)
    {
      SPDIF_WeightedLinearPhaseFir4x_Init(
          &player_spdif_minphase_fir_upsampler, sample_rate);
    }
    else if (spdif_mode == USB_AUDIO_SPDIF_UPSAMPLE_4X_WLS_MINPHASE_NS5)
    {
      SPDIF_WeightedMinimumPhaseFir4x_Init(
          &player_spdif_minphase_fir_upsampler, sample_rate);
    }
    else if (spdif_mode == USB_AUDIO_SPDIF_UPSAMPLE_4X_FIR_MINPHASE_NS5)
    {
      SPDIF_MinimumPhaseFir4x_Init(&player_spdif_minphase_fir_upsampler,
                                   sample_rate);
    }
    else if (spdif_mode == USB_AUDIO_SPDIF_UPSAMPLE_4X_BESSEL_MINPHASE_NS5)
    {
      SPDIF_MinimumPhaseUpsampler4x_InitBesselNoiseShaped5(
          &player_spdif_hybrid_upsampler, sample_rate);
    }
    else if (spdif_mode == USB_AUDIO_SPDIF_UPSAMPLE_4X_BESSEL_OPEN_NS2)
    {
      SPDIF_MinimumPhaseUpsampler4x_InitBesselOpen(
          &player_spdif_hybrid_upsampler, sample_rate);
    }
    else if (spdif_mode == USB_AUDIO_SPDIF_UPSAMPLE_4X_BESSEL_MINPHASE_NS2)
    {
      SPDIF_MinimumPhaseUpsampler4x_InitBessel(
          &player_spdif_hybrid_upsampler, sample_rate);
    }
    else if ((spdif_mode == USB_AUDIO_SPDIF_UPSAMPLE_4X_BUTTERWORTH_NS2) ||
        (spdif_mode ==
         USB_AUDIO_SPDIF_UPSAMPLE_4X_BUTTERWORTH_MINPHASE_NS2))
    {
      SPDIF_HybridUpsampler4x_InitButterworth(
          &player_spdif_hybrid_upsampler, sample_rate);
    }
    player_spdif_upsample =
        ((spdif_mode != USB_AUDIO_SPDIF_NATIVE) &&
         (bits_per_sample == 16U) &&
         ((sample_rate == 44100U) || (sample_rate == 48000U))) ? 1U : 0U;
    player_spdif_headroom =
        ((player_spdif_upsample != 0U) &&
         ((spdif_mode == USB_AUDIO_SPDIF_UPSAMPLE_4X_HEADROOM) ||
          (spdif_mode == USB_AUDIO_SPDIF_UPSAMPLE_4X_TPDF))) ? 1U : 0U;
    player_spdif_repeat =
        ((player_spdif_upsample != 0U) &&
         (spdif_mode == USB_AUDIO_SPDIF_REPEAT_4X)) ? 1U : 0U;
    player_spdif_tpdf =
        ((player_spdif_upsample != 0U) &&
         (spdif_mode == USB_AUDIO_SPDIF_UPSAMPLE_4X_TPDF)) ? 1U : 0U;
    player_spdif_iir =
        ((player_spdif_upsample != 0U) &&
         (spdif_mode == USB_AUDIO_SPDIF_UPSAMPLE_4X_IIR)) ? 1U : 0U;
    player_spdif_hybrid =
        ((player_spdif_upsample != 0U) &&
         (spdif_mode == USB_AUDIO_SPDIF_UPSAMPLE_4X_HYBRID)) ? 1U : 0U;
    player_spdif_hybrid_ns2 =
        ((player_spdif_upsample != 0U) &&
         ((spdif_mode == USB_AUDIO_SPDIF_UPSAMPLE_4X_HYBRID_NS2) ||
          (spdif_mode == USB_AUDIO_SPDIF_UPSAMPLE_4X_BUTTERWORTH_NS2))) ?
        1U : 0U;
    player_spdif_minphase_ns2 =
        ((player_spdif_upsample != 0U) &&
         ((spdif_mode ==
           USB_AUDIO_SPDIF_UPSAMPLE_4X_BUTTERWORTH_MINPHASE_NS2) ||
          (spdif_mode ==
           USB_AUDIO_SPDIF_UPSAMPLE_4X_BESSEL_MINPHASE_NS2) ||
          (spdif_mode ==
           USB_AUDIO_SPDIF_UPSAMPLE_4X_BESSEL_OPEN_NS2))) ? 1U : 0U;
    player_spdif_minphase_ns5 =
        ((player_spdif_upsample != 0U) &&
         (spdif_mode ==
          USB_AUDIO_SPDIF_UPSAMPLE_4X_BESSEL_MINPHASE_NS5)) ? 1U : 0U;
    player_spdif_minphase_fir =
        ((player_spdif_upsample != 0U) &&
         ((spdif_mode ==
           USB_AUDIO_SPDIF_UPSAMPLE_4X_FIR_MINPHASE_NS5) ||
          (spdif_mode ==
           USB_AUDIO_SPDIF_UPSAMPLE_4X_WLS_MINPHASE_NS5) ||
          (spdif_mode ==
           USB_AUDIO_SPDIF_UPSAMPLE_4X_WLS_LINEARPHASE_NS5))) ? 1U : 0U;
    player_spdif_wls_listen =
        ((player_spdif_upsample != 0U) &&
         (spdif_mode ==
          USB_AUDIO_SPDIF_UPSAMPLE_4X_WLS_LISTEN_NS5)) ? 1U : 0U;
    return (SPDIF_TX_Init(player_spdif_upsample != 0U ?
                          sample_rate * PLAYER_SPDIF_FACTOR : sample_rate,
                          bits_per_sample)
            != 0U) ?
           AUDIO_OK : AUDIO_ERROR;
  }

  if (Touch_I2C_Reserve(500U) == 0U) return AUDIO_ERROR;
  result = BSP_AUDIO_OUT_InitEx(OUTPUT_DEVICE_HEADPHONE, volume, sample_rate,
                                bits_per_sample);
  if (result == AUDIO_OK)
  {
    BSP_AUDIO_OUT_SetAudioFrameSlot(CODEC_AUDIOFRAME_SLOT_02);
  }
  Touch_I2C_Release();
  return result;
}

static uint8_t Player_CodecCommand(uint8_t command, uint8_t value)
{
  uint8_t result = AUDIO_ERROR;
  if (player_output == USB_AUDIO_OUTPUT_SPDIF)
  {
    if (command == PLAYER_COMMAND_TOGGLE)
    {
      if (value != 0U) SPDIF_TX_Pause();
      else SPDIF_TX_Resume();
      result = AUDIO_OK;
    }
    else if (command == PLAYER_COMMAND_VOLUME)
    {
      /* Keep S/PDIF bit-perfect; volume is controlled by the receiver. */
      result = AUDIO_OK;
    }
    else if (command == PLAYER_COMMAND_STOP)
    {
      SPDIF_TX_Stop();
      result = AUDIO_OK;
    }
    return result;
  }

  if (Touch_I2C_Reserve(500U) == 0U) return AUDIO_ERROR;
  if (command == PLAYER_COMMAND_TOGGLE)
  {
    if (value != 0U)
    {
      result = BSP_AUDIO_OUT_Pause();
    }
    else
    {
      result = BSP_AUDIO_OUT_Resume();
    }
  }
  else if (command == PLAYER_COMMAND_VOLUME)
  {
    result = BSP_AUDIO_OUT_SetVolume(value);
  }
  else if (command == PLAYER_COMMAND_STOP)
  {
    result = BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW);
  }
  Touch_I2C_Release();
  return result;
}

