136185925/STM32F769I-DISCO-USB-Audio-Upsampler/Core/Src/audio_player.c
static uint8_t Player_StartOutput(void)
{
  uint8_t result;
  if (player_output == USB_AUDIO_OUTPUT_SPDIF)
  {
    return (SPDIF_TX_Start(player_dma_buffer, PLAYER_DMA_BYTES) != 0U) ?
           AUDIO_OK : AUDIO_ERROR;
  }

  if (Touch_I2C_Reserve(500U) == 0U) return AUDIO_ERROR;
  result = BSP_AUDIO_OUT_Play((uint16_t *)player_dma_buffer, PLAYER_DMA_BYTES);
  Touch_I2C_Release();
  return result;
}

static void Player_Close(FIL *file, uint8_t *file_open, uint8_t stop_hardware)
{
  player_active = 0U;
  if (stop_hardware != 0U)
  {
    (void)Player_CodecCommand(PLAYER_COMMAND_STOP, 0U);
    if (player_output == USB_AUDIO_OUTPUT_SPDIF) SPDIF_TX_DeInit();
    else BSP_AUDIO_OUT_DeInit();
  }
  if (*file_open != 0U)
  {
    (void)f_close(file);
    *file_open = 0U;
  }
}

void AudioPlayer_Task(void const *argument)
{
  FIL file;
  PlayerWaveInfo wave;
  PlayerCommand command;
  AudioPlayerSnapshot snapshot;
  uint32_t notify_bits;
  uint32_t loaded_bytes = 0U;
  uint32_t played_bytes = 0U;
  uint32_t valid_bytes[2] = {0U, 0U};
  uint8_t valid_output[2] = {0U, 0U};
  uint8_t file_open = 0U;
  uint8_t hardware_ready = 0U;
  uint8_t paused = 0U;
  uint8_t io_error = 0U;
  char path[24];
  FRESULT result;

  (void)argument;
  player_task_handle = xTaskGetCurrentTaskHandle();
  AudioPlayer_GetSnapshot(&snapshot);

  for (;;)
  {
    notify_bits = 0U;
    (void)xTaskNotifyWait(0U, 0xFFFFFFFFUL, &notify_bits, pdMS_TO_TICKS(50U));

    if (audio_player_debug_command != 0U)
    {
      memset(&command, 0, sizeof(command));
      if (audio_player_debug_command == 1U)
      {
        command.type = PLAYER_COMMAND_PLAY;
        strncpy(command.filename, "1.wav", sizeof(command.filename) - 1U);
      }
      else if (audio_player_debug_command == 2U)
      {
        command.type = PLAYER_COMMAND_TOGGLE;
      }
      else
      {
        command.type = PLAYER_COMMAND_STOP;
      }
      audio_player_debug_command = 0U;
      (void)xQueueSendToFront(player_command_queue, &command, 0U);
    }

    while (xQueueReceive(player_command_queue, &command, 0U) == pdPASS)
    {
      if (command.type == PLAYER_COMMAND_PLAY)
      {
        Player_Close(&file, &file_open, hardware_ready);
        hardware_ready = 0U;
        paused = 0U;
        memset(&wave, 0, sizeof(wave));
        memset(&snapshot, 0, sizeof(snapshot));
        snapshot.status = AUDIO_PLAYER_LOADING;
        snapshot.volume = player_volume;
        strncpy(snapshot.filename, command.filename, sizeof(snapshot.filename) - 1U);
        Player_Publish(&snapshot);

        if ((SD_Card_IsPresent() == 0U) || (sd_storage_status != SD_STORAGE_READY))
        {
          snapshot.status = AUDIO_PLAYER_NO_CARD;
          Player_Publish(&snapshot);
          continue;
        }
        if ((AudioRecorder_IsBusy() != 0U) ||
            (USB_Audio_ClaimsCodec() != 0U))
        {
          snapshot.status = AUDIO_PLAYER_BUSY;
          Player_Publish(&snapshot);
          continue;
        }
        if (AudioSpectrum_IsBusy() != 0U)
        {
          snapshot.status = AUDIO_PLAYER_BUSY;
          Player_Publish(&snapshot);
          continue;
        }

        player_active = 1U;
        (void)snprintf(path, sizeof(path), "%s/%s", USERPath, snapshot.filename);
        result = f_open(&file, path, FA_READ);
        if (result == FR_OK)
        {
          file_open = 1U;
          result = Player_ParseWave(&file, &wave);
        }
        if (result != FR_OK)
        {
          snapshot.status = (result == FR_INVALID_PARAMETER ||
                             result == FR_INVALID_OBJECT) ?
                            AUDIO_PLAYER_UNSUPPORTED : AUDIO_PLAYER_ERROR;
          snapshot.last_fatfs_result = (uint8_t)result;
          ++audio_player_error_count;
          Player_Close(&file, &file_open, 0U);
          Player_Publish(&snapshot);
          continue;
        }

        snapshot.channels = (uint8_t)wave.channels;
        snapshot.bits_per_sample = (uint8_t)wave.bits_per_sample;
        snapshot.sample_rate = wave.sample_rate;
        snapshot.data_bytes = wave.data_bytes;
        snapshot.duration_ms = wave.byte_rate == 0U ? 0U :
            (uint32_t)(((uint64_t)wave.data_bytes * 1000U) / wave.byte_rate);
        if (Player_CodecInit(wave.sample_rate, wave.bits_per_sample,
                             snapshot.volume) != AUDIO_OK)
        {
          snapshot.status = AUDIO_PLAYER_ERROR;
          ++audio_player_error_count;
          if (player_output == USB_AUDIO_OUTPUT_SPDIF) SPDIF_TX_DeInit();
          else BSP_AUDIO_OUT_DeInit();
          Player_Close(&file, &file_open, 0U);
          Player_Publish(&snapshot);
          continue;
        }
        hardware_ready = 1U;
        player_spdif_status_frame = 0U;
        loaded_bytes = 0U;
        played_bytes = 0U;
        io_error = 0U;
        valid_bytes[0] = Player_FillHalf(&file, &wave, 0U, loaded_bytes, &io_error);
        valid_output[0] = player_last_fill_output_valid;
        loaded_bytes += valid_bytes[0];
        valid_bytes[1] = Player_FillHalf(&file, &wave, 1U, loaded_bytes, &io_error);
        valid_output[1] = player_last_fill_output_valid;
        loaded_bytes += valid_bytes[1];
        if ((io_error != 0U) || (valid_output[0] == 0U))
        {
          snapshot.status = AUDIO_PLAYER_ERROR;
          snapshot.last_fatfs_result = io_error;
          ++audio_player_error_count;
          Player_Close(&file, &file_open, hardware_ready);
          hardware_ready = 0U;
          Player_Publish(&snapshot);
          continue;
        }
        result = (FRESULT)Player_StartOutput();
        if ((uint8_t)result != AUDIO_OK)
        {
          snapshot.status = AUDIO_PLAYER_ERROR;
          ++audio_player_error_count;
          Player_Close(&file, &file_open, hardware_ready);
          hardware_ready = 0U;
          Player_Publish(&snapshot);
          continue;
        }
        player_active = 1U;
        notify_bits &= ~(PLAYER_NOTIFY_HALF | PLAYER_NOTIFY_FULL);
        snapshot.status = AUDIO_PLAYER_PLAYING;
        Player_UpdatePosition(&snapshot, 0U);
        Player_Publish(&snapshot);
      }
      else if (command.type == PLAYER_COMMAND_TOGGLE)
      {
        if (snapshot.status == AUDIO_PLAYER_PLAYING)
        {
          if (Player_CodecCommand(PLAYER_COMMAND_TOGGLE, 1U) == AUDIO_OK)
          {
            paused = 1U;
            snapshot.status = AUDIO_PLAYER_PAUSED;
            Player_Publish(&snapshot);
          }
        }
        else if (snapshot.status == AUDIO_PLAYER_PAUSED)
        {
          if (Player_CodecCommand(PLAYER_COMMAND_TOGGLE, 0U) == AUDIO_OK)
          {
            paused = 0U;
            snapshot.status = AUDIO_PLAYER_PLAYING;
            Player_Publish(&snapshot);
          }
        }
      }
      else if (command.type == PLAYER_COMMAND_VOLUME)
      {
        snapshot.volume = (uint8_t)command.value;
        player_volume = snapshot.volume;
        if ((hardware_ready == 0U) ||
            (Player_CodecCommand(PLAYER_COMMAND_VOLUME, snapshot.volume) == AUDIO_OK))
        {
          Player_Publish(&snapshot);
        }
      }
      else if (command.type == PLAYER_COMMAND_SEEK)
      {
        if ((file_open != 0U) && (hardware_ready != 0U) &&
            ((snapshot.status == AUDIO_PLAYER_PLAYING) ||
             (snapshot.status == AUDIO_PLAYER_PAUSED)))
        {
          uint32_t target = (uint32_t)(((uint64_t)wave.data_bytes * command.value) / 1000U);
          target -= target % wave.block_align;
          (void)Player_CodecCommand(PLAYER_COMMAND_STOP, 0U);
          result = f_lseek(&file, wave.data_offset + target);
          if (result == FR_OK)
          {
            player_spdif_status_frame = 0U;
            player_spdif_tail_frames = 0U;
            SPDIF_Upsampler4x_Reset(&player_spdif_upsampler);
            SPDIF_IirUpsampler4x_Reset(&player_spdif_iir_upsampler);
            SPDIF_HybridUpsampler4x_Reset(&player_spdif_hybrid_upsampler);
            loaded_bytes = target;
            played_bytes = target;
            io_error = 0U;
            valid_bytes[0] = Player_FillHalf(&file, &wave, 0U, loaded_bytes, &io_error);
            valid_output[0] = player_last_fill_output_valid;
            loaded_bytes += valid_bytes[0];
            valid_bytes[1] = Player_FillHalf(&file, &wave, 1U, loaded_bytes, &io_error);
            valid_output[1] = player_last_fill_output_valid;
            loaded_bytes += valid_bytes[1];
            if ((io_error == 0U) && (valid_output[0] != 0U) &&
                (Player_StartOutput() == AUDIO_OK))
            {
              if (paused != 0U)
              {
                (void)Player_CodecCommand(PLAYER_COMMAND_TOGGLE, 1U);
              }
              notify_bits &= ~(PLAYER_NOTIFY_HALF | PLAYER_NOTIFY_FULL);
              Player_UpdatePosition(&snapshot, played_bytes);
            }
            else if ((io_error == 0U) && (valid_output[0] == 0U))
            {
              Player_Close(&file, &file_open, hardware_ready);
              hardware_ready = 0U;
              snapshot.status = AUDIO_PLAYER_FINISHED;
              Player_UpdatePosition(&snapshot, snapshot.data_bytes);
              Player_Publish(&snapshot);
            }
            else
            {
              result = FR_DISK_ERR;
            }
          }
          if ((result != FR_OK) && (snapshot.status != AUDIO_PLAYER_FINISHED))
          {
            snapshot.status = AUDIO_PLAYER_ERROR;
            snapshot.last_fatfs_result = (uint8_t)result;
            ++audio_player_error_count;
            Player_Close(&file, &file_open, hardware_ready);
            hardware_ready = 0U;
            Player_Publish(&snapshot);
          }
        }
      }
      else if (command.type == PLAYER_COMMAND_STOP)
      {
        Player_Close(&file, &file_open, hardware_ready);
        hardware_ready = 0U;
        paused = 0U;
        snapshot.status = AUDIO_PLAYER_IDLE;
        snapshot.position_bytes = 0U;
        snapshot.position_ms = 0U;
        Player_Publish(&snapshot);
      }
    }

    if ((player_active != 0U) && (SD_Card_IsPresent() == 0U))
    {
      Player_Close(&file, &file_open, hardware_ready);
      hardware_ready = 0U;
      snapshot.status = AUDIO_PLAYER_NO_CARD;
      snapshot.last_fatfs_result = (uint8_t)FR_NOT_READY;
      Player_Publish(&snapshot);
      continue;
    }

    if (player_active != 0U)
    {
      for (uint8_t half = 0U; half < 2U; ++half)
      {
        const uint32_t bit = (half == 0U) ? PLAYER_NOTIFY_HALF : PLAYER_NOTIFY_FULL;
        if ((notify_bits & bit) == 0U) continue;
        played_bytes += valid_bytes[half];
        valid_bytes[half] = Player_FillHalf(&file, &wave, half, loaded_bytes, &io_error);
        valid_output[half] = player_last_fill_output_valid;
        loaded_bytes += valid_bytes[half];
        Player_UpdatePosition(&snapshot, played_bytes);
        if (io_error != 0U)
        {
          snapshot.status = AUDIO_PLAYER_ERROR;
          snapshot.last_fatfs_result = io_error;
          ++audio_player_error_count;
          Player_Close(&file, &file_open, hardware_ready);
          hardware_ready = 0U;
          Player_Publish(&snapshot);
          break;
        }
        if ((valid_output[0] == 0U) && (valid_output[1] == 0U))
        {
          Player_Close(&file, &file_open, hardware_ready);
          hardware_ready = 0U;
          snapshot.status = AUDIO_PLAYER_FINISHED;
          Player_UpdatePosition(&snapshot, snapshot.data_bytes);
          Player_Publish(&snapshot);
          break;
        }
      }
    }
  }
}

void BSP_AUDIO_OUT_HalfTransfer_CallBack(void)
{
  if (USB_Audio_DmaIsRunning() != 0U)
  {
    USB_Audio_DmaHalfCallback();
    return;
  }
  BaseType_t higher_priority_task_woken = pdFALSE;
  ++audio_player_dma_half_count;
  if (player_task_handle != NULL)
  {
    (void)xTaskNotifyFromISR(player_task_handle, PLAYER_NOTIFY_HALF,
                             eSetBits, &higher_priority_task_woken);
    portYIELD_FROM_ISR(higher_priority_task_woken);
  }
}

void BSP_AUDIO_OUT_TransferComplete_CallBack(void)
{
  if (USB_Audio_DmaIsRunning() != 0U)
  {
    USB_Audio_DmaFullCallback();
    return;
  }
  BaseType_t higher_priority_task_woken = pdFALSE;
  ++audio_player_dma_full_count;
  if (player_task_handle != NULL)
  {
    (void)xTaskNotifyFromISR(player_task_handle, PLAYER_NOTIFY_FULL,
                             eSetBits, &higher_priority_task_woken);
    portYIELD_FROM_ISR(higher_priority_task_woken);
  }
}

void BSP_AUDIO_OUT_Error_CallBack(void)
{
  if (USB_Audio_IsActive() != 0U)
  {
    USB_Audio_DmaErrorCallback();
    return;
  }
  ++audio_player_error_count;
}
